---
kind: type
id: T:Autodesk.Revit.DB.Analysis.MassSurfaceDataSource
source: html/64d3b063-b6d0-3e99-734d-8bc2f60af016.htm
---
# Autodesk.Revit.DB.Analysis.MassSurfaceDataSource

Indicates whether values for the properties of the MassSurfaceData
 are synchronized with the EnergyDataSettings of the
 document or instead, serve as overrides of those settings.

## Syntax (C#)
```csharp
public enum MassSurfaceDataSource
```